tps/spin_wait_delay_with_pareto_rand_type.txt
spin_wait_delay以外のパラメータはdefault
spin_wait_delay = 0
$> =ttaskset -c 1-7,9-15 sysbench oltp_read_write \
    --mysql-host=127.0.0.1 \
    --mysql-port=3306 \
    --mysql-user=root \
    --mysql-password=password \
    --mysql-db=sbtest \
    --tables=1 \
    --table_size=100000 \
    --threads=32 \
    --time=60 \
    --rand-type=special \
 \  \  \  \  \  \  \ p \a \r \e \t \o \>
ktaskset\sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            374892
        write:                           106419
        other:                           53289
        total:                           534600
    transactions:                        26511  (441.53 per sec.)
    queries:                             534600 (8903.53 per sec.)
    ignored errors:                      267    (4.45 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0415s
    total number of events:              26511

Latency (ms):
         min:                                    5.29
         avg:                                   72.44
         max:                                  309.87
         95th percentile:                      150.29
         sum:                              1920554.28

Threads fairness:
    events (avg/stddev):           828.4688/17.58
    execution time (avg/stddev):   60.0173/0.01

🦈 ~/mysql_test/tps @ann🐪 
$> =eecho 'spin_wait_delay = 20'' ' 1'>
kecho\spin_wait_delay = 1
🐶 ~/mysql_test/tps @ann🦊 
$> =ttaskset -c 1-7,9-15 sysbench oltp_read_write \
    --mysql-host=127.0.0.1 \
    --mysql-port=3306 \
    --mysql-user=root \
    --mysql-password=password \
    --mysql-db=sbtest \
    --tables=1 \
    --table_size=100000 \
    --threads=32 \
    --time=60 \
    --rand-type=pareto \
    run>
ktaskset\sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            374206
        write:                           106242
        other:                           53201
        total:                           533649
    transactions:                        26472  (440.74 per sec.)
    queries:                             533649 (8884.93 per sec.)
    ignored errors:                      257    (4.28 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0603s
    total number of events:              26472

Latency (ms):
         min:                                    5.28
         avg:                                   72.56
         max:                                  423.57
         95th percentile:                      153.02
         sum:                              1920934.19

Threads fairness:
    events (avg/stddev):           827.2500/24.84
    execution time (avg/stddev):   60.0292/0.02

🐒 ~/mysql_test/tps @ann🐣 
$> =eecho 'spin_wait_delay = 1'20'6(default)'1'         6(default)'>
kecho\spin_wait_delay = 6(default)
🦔 ~/mysql_test/tps @ann🦉 
$> =ttaskset -c 1-7,9-15 sysbench oltp_read_write \
    --mysql-host=127.0.0.1 \
    --mysql-port=3306 \
    --mysql-user=root \
    --mysql-password=password \
    --mysql-db=sbtest \
    --tables=1 \
    --table_size=100000 \
    --threads=32 \
    --time=60 \
    --rand-type=pareto \
    run>
ktaskset\sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            360766
        write:                           102397
        other:                           51283
        total:                           514446
    transactions:                        25514  (424.89 per sec.)
    queries:                             514446 (8567.23 per sec.)
    ignored errors:                      255    (4.25 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0461s
    total number of events:              25514

Latency (ms):
         min:                                    5.25
         avg:                                   75.28
         max:                                  410.51
         95th percentile:                      158.63
         sum:                              1920643.93

Threads fairness:
    events (avg/stddev):           797.3125/26.33
    execution time (avg/stddev):   60.0201/0.01

🐣 ~/mysql_test/tps @ann🐒 
$> =eecho 'spin_wait_delay = 6(default)'' ' ' ' ' ' ' ' ' ' 2'0'>
kecho\spin_wait_delay = 20
🐯 ~/mysql_test/tps @ann🐬 
$> =ttaskset -c 1-7,9-15 sysbench oltp_read_write \
    --mysql-host=127.0.0.1 \
    --mysql-port=3306 \
    --mysql-user=root \
    --mysql-password=password \
    --mysql-db=sbtest \
    --tables=1 \
    --table_size=100000 \
    --threads=32 \
    --time=60 \
    --rand-type=pareto \
    run>
ktaskset\sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            330680
        write:                           93919
        other:                           47025
        total:                           471624
    transactions:                        23405  (389.74 per sec.)
    queries:                             471624 (7853.41 per sec.)
    ignored errors:                      215    (3.58 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0514s
    total number of events:              23405

Latency (ms):
         min:                                    5.24
         avg:                                   82.07
         max:                                  454.62
         95th percentile:                      173.58
         sum:                              1920772.40

Threads fairness:
    events (avg/stddev):           731.4062/23.39
    execution time (avg/stddev):   60.0241/0.01

🐧 ~/mysql_test/tps @ann🦭 
$> =eexit>
kexit\
Script done on 2026-02-20 14:57:47+09:00 [COMMAND_EXIT_CODE="0"]